app/views/properties/show.html.erb

SELECT  `images`.* FROM `images`  WHERE `images`.`property_id` = 1  ORDER BY `images`.`id` ASC LIMIT 1
---
   <dt><strong><%= model_class.human_attribute_name(:image)%>:</strong></dt>
  <dd><%= image_tag(@property.images.first.image.url(:original)) %></dd>