app/views/home/land1.html.erb

SELECT properties.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8399 - properties.latitude) * PI() / 180 / 2), 2) + COS(12.8399 * PI() / 180) * COS(properties.latitude * PI() / 180) * POWER(SIN((77.677 - properties.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((properties.longitude - 77.677) / 57.2957795), ((properties.latitude - 12.8399) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `properties`  WHERE (properties.latitude BETWEEN 11.39258216889152 AND 14.28721783110848 AND properties.longitude BETWEEN 76.19256359082425 AND 79.16143640917576 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8399 - properties.latitude) * PI() / 180 / 2), 2) + COS(12.8399 * PI() / 180) * COS(properties.latitude * PI() / 180) * POWER(SIN((77.677 - properties.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 100 AND properties.id != 3)  ORDER BY distance ASC
---
        <a class="btn-login btn_back" href="/home/land1?id=<% if @properties.last.id == @property.id %><%= @properties.last.id %><%else%> <%=(@property.id)+1 %><%end%>" title="Next"> <i class="fa fa-chevron-right"></i></a>
        <%= ((current_user and @property.document.url.present?) ? (link_to "Download", @property.document.url, :class => 'btn-login btn-back', :style => 'float: right;') : (@property.document.present? ? (link_to "Download", "#", :onclick => 'alerte()', :class => 'btn-login btn-back', :style => 'float: right;') : (link_to "Download", "#", :onclick => "property()", :class => 'btn-login btn-back'))) %>

SELECT  `images`.* FROM `images`  WHERE `images`.`property_id` = 3  ORDER BY `images`.`id` ASC LIMIT 1
---

                    <%= link_to image_tag(@property.images.first.image.url(:original)),  image_slide_home_path(@property ) %>