app/controllers/home_controller.rb

SELECT `properties`.* FROM `properties`  WHERE `properties`.`city` = 'Bangalore'  ORDER BY `properties`.`price` ASC
---
  def land
    if params[:price] == "low"
      @properties = Property.where(:city => params[:city]).order("price asc")

SELECT properties.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8399 - properties.latitude) * PI() / 180 / 2), 2) + COS(12.8399 * PI() / 180) * COS(properties.latitude * PI() / 180) * POWER(SIN((77.677 - properties.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((properties.longitude - 77.677) / 57.2957795), ((properties.latitude - 12.8399) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `properties`  WHERE (properties.latitude BETWEEN 11.39258216889152 AND 14.28721783110848 AND properties.longitude BETWEEN 76.19256359082425 AND 79.16143640917576 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8399 - properties.latitude) * PI() / 180 / 2), 2) + COS(12.8399 * PI() / 180) * COS(properties.latitude * PI() / 180) * POWER(SIN((77.677 - properties.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 100 AND properties.id != 3)  ORDER BY distance ASC
SELECT  `properties`.* FROM `properties`  WHERE `properties`.`city` = 'Bangalore'  ORDER BY `properties`.`id` DESC LIMIT 1
SELECT  `images`.* FROM `images`  WHERE `images`.`property_id` = 3  ORDER BY `images`.`id` ASC LIMIT 1
---
  def land1
    @property = Property.find(params[:id])
    @properties = Property.where(:city => @property.city)

    property = @property.dup

    property_for_bus = @property.dup
    property_for_bus.longitude = property_for_bus.bus_lng
    property_for_bus.latitude = property_for_bus.bus_lat

    property_for_train = @property.dup
    property_for_train.longitude = property_for_train.train_lng
    property_for_train.latitude = property_for_train.train_lat

    property_for_airport = @property.dup
    property_for_airport.longitude = property_for_airport.airport_lng
    property_for_airport.latitude = property_for_airport.airport_lat

    @managed_property = [ property, property_for_bus, property_for_train, property_for_airport ].compact

#    @json = @managed_property.to_gmaps4rails
    @hash = Gmaps4rails.build_markers(@managed_property) do |property, marker|
      marker.lat property.latitude
      marker.lng property.longitude
    end
    @images = Image.where(:property_id =>@property.id)

SELECT  `properties`.* FROM `properties`  WHERE `properties`.`id` = 2 LIMIT 1
SELECT `images`.* FROM `images`  WHERE `images`.`property_id` = 2
---
    def image_slide
    @property = Property.find(params[:id])
    @images = Image.where(:property_id =>@property.id)