app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT `properties`.* FROM `properties`

  def create
    @property = Property.new(property_params)
    1.times{@property.images.build} if @property.images.blank?
    respond_to do |format|
      if @property.save
---
INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `property_id`, `updated_at`) VALUES ('2014-09-29 10:08:38', 'image/png', 'img-land4.png', 10184, '2014-09-29 10:08:35', 1, '2014-09-29 10:08:38')
INSERT INTO `properties` (`borewell_status`, `boundary_status`, `city`, `consultant`, `created_at`, `description`, `drainage_status`, `electricity_type`, `email`, `inleave_rode`, `land_status`, `latitude`, `location`, `longitude`, `mobile`, `name`, `person_type`, `present_land_status`, `shed_status`, `title`, `type_of_land`, `updated_at`, `video_url`) VALUES ('', '', 'Anantapur', '', '2014-09-29 10:08:38', '1 Acre 30 gunta residential layout suitable land for sale , located at KRS road Mugrahalli villagr Mysore . Asking rate Rs - 175,00,000/- per acre .', '', '', 'katta04.bhagath@gmail.com', '', '', 14.6818877, 'ananthapur', 77.6005911, '978643453', 'apartment', '', '', '', '', '', '2014-09-29 10:08:38', '')

  def update
    respond_to do |format|
      if @property.update(property_params)
---
UPDATE `properties` SET `latitude` = 12.9128118, `location` = 'btm', `longitude` = 77.6092188, `updated_at` = '2014-09-29 10:13:57' WHERE `properties`.`id` = 3

  def set_property
    @property = Property.find(params[:id])
---
SELECT  `properties`.* FROM `properties`  WHERE `properties`.`id` = 3 LIMIT 1